{
    "guides": [
        {
            "word": "App",
            "guide": "<p class='rtl'>یک مثال از متن فارسی</p>"
        },
        {
            "word": "useState",
            "guide": "<p class='ltr'>useState(initialState)</p>\n<p class='ltr'>Call useState at the top level of your component to declare a state variable.</p>\n<p class='rtl'>این تابع را برای تعریف یک متغیر حالت (state variable) در بالاترین لایه‌ی کامپوننت (component) خود صدا بزنید.</p>\n<pre><code class=\"lang-js\">import { useState } from 'react';\nfunction MyComponent() {\n  const [age, setAge] = useState(28);\n  const [name, setName] = useState('Taylor');\n  const [todos, setTodos] = useState(() => createTodos());\n  // ...</code></pre>\n<p class='ltr'>The convention is to name state variables like [something, setSomething] using array destructuring.<p>\n<p class='rtl'>بهتر است متغیر حالت خود را با استفاده از جداسازی آرایه‌ای (array deconstructing) به شکل [name, setname] نامگذاری کنید.<p class='rtl'>\n<p class='ltr'>See more examples below.</p>\n<p class='rtl'>مثال‌های بیشتری در ادامه خواهیم آورد.</p>\n<p class='ltr'>Parameters </p>\n<p class='rtl'>پارامترها:</p>\n<p class='ltr'>initialState: The value you want the state to be initially. It can be a value of any type, but there is a special behavior for functions. This argument is ignored after the initial render.</p>\n<p class='rtl'>initialState: مقداری که می‌خواهید متغیر حالت شما در ابتدا داشته باشد. این مقدار می‌تواند از هر جنسی باشد، ولی در صورت استفاده از توابع، رفتار خاصی انجام خواهد شد. به این آرگومان بعد از نمایش (render) اولیه توجهی نخواهد شد.</p>\n<p class='ltr'>If you pass a function as initialState, it will be treated as an initializer function. It should be pure, should take no arguments, and should return a value of any type. React will call your initializer function when initializing the component, and store its return value as the initial state. See an example below.</p>\n<p class='rtl'>اگر به جای این پارامتر یک تابع قرار دهید، با این تابع به عنوان یک تابع مقدار دهی اولیه (initializer function) رفتار خواهد شد. این تابع باید مطلق (pure) باشد، هیچ آرگومانی نگیرد و باید یک مقدار (از هر نوعی) برگردارند. ری‌اکت تابع مقدار دهی اولیه‌ی شما را زمانی که کامپوننت را برای اولین بار راه اندازی می‌کند (initializing) فراخوانی می‌کند، و مقدار خروجی آن را به عنوان وضعیت اولیه نگهداری می‌کند. یک مثال از پایین مشاهده کنید.</p>\n<p class='ltr'>Returns </p>\n<p class='rtl'>خروجی تابع:</p>\n<p class='ltr'>useState returns an array with exactly two values:</p>\n<p class='rtl'>useState یک آرایه با دقیقا دو عضو برمی‌گرداند:</p>\n<p class='ltr'>The current state. During the first render, it will match the initialState you have passed.</p>\n<p class='rtl'>وضعیت فعلی. در نمایش اولیه، این مقدار برابر است با initialState ای که شما به آن تحویل (pass) داده اید.</p>\n<p class='ltr'>The set function that lets you update the state to a different value and trigger a re-render.</p>\n<p class='rtl'>تابع مقدار دهی‌ای (set function) که به شما امکان به روز رسانی متغیر وضعیت را خواهد داد، و باعث یک بازنمایش (re-render) خواهد شد.</p>"
        }
    ]
}